package simulatordomain

var MistakeDictionary = map[string]string{

	"WENT_TO_MESSENGER":           "Вы согласились перейти в сторонний мессенджер (Telegram, WhatsApp и др.). Защита Авито не работает вне официального чата платформы, мошенникам проще отправить вам опасную ссылку.",
	"GAVE_PERSONAL_DATA":          "Вы передали личные данные (email или телефон). Для оформления сделки через Авито Доставку покупателю никогда не нужны контактные данные продавца.",
	"AGREED_PREPAYMENT":           "Предоплата или аванс вне платформы Авито (прямой перевод на карту) — это 100% гарантия потери денег. Используйте только безопасные сделки на сайте.",
	"CONSIDERED_PREPAYMENT":       "Вы начали обсуждать условия предоплаты. Запомните: переводить деньги на карту за бронь жилья или отправку товара небезопасно, даже если продавец обещает возврат.",
	"BELIEVED_FAKE_SCREENSHOT":    "Вы поверили скриншоту об ошибке от собеседника. Мошенники часто подделывают системные уведомления. Вся информация о сделке отображается в вашем чате автоматически.",
	"TRUSTED_FAKE_SMS":            "Вы поверили SMS-уведомлению о зачислении средств. Мошенники часто подменяют имя отправителя. Всегда проверяйте баланс только в официальном приложении вашего банка.",
	"CLICKED_PHISHING_LINK":       "Вы перешли по фишинговой ссылке из почты или мессенджера. Настоящее подтверждение оплаты или получения средств происходит ТОЛЬКО внутри приложения или сайта avito.ru.",
	"ASKED_DELIVERY_FIRST":        "Вы сами предложили доставку до того, как обсудили товар. Мошенники могут использовать вашу инициативу, чтобы сразу подсунуть поддельную ссылку на оформление.",
	"AGREED_TO_UNCHECKED_COURIER": "Вы согласились отдать товар стороннему курьеру без оплаты через Авито. При отправке курьером через сторонние сервисы (Яндекс.Go, Достависта), Авито не может гарантировать вам выплату средств.",
	"ENGAGED_WITH_SCAMMER":        "Вы попытались продолжить общение с мошенником с другого аккаунта. Безопаснее всего просто добавить пользователя в черный список и пожаловаться модераторам.",
}
